; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	image2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 spectrograph3)
	(have_image Planet7 spectrograph3)
	(have_image Star8 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 4
3. (turn_to satellite0 star4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star4)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 4
6. (take_image satellite0 phenomenon6 instrument0 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 1 of 4
7. (turn_to satellite0 planet5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet5)
   goals met: 1 of 4
8. (take_image satellite0 planet5 instrument0 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 2 of 4
9. (turn_to satellite0 planet7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet7)
   goals met: 2 of 4
10. (take_image satellite0 planet7 instrument0 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 3 of 4
11. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 3 of 4
12. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 4 of 4
